layer {
	name: "window_data"
	top:  "data"
	top:  "label"
	type: "GenericWindowData"
	generic_window_data_param {
		source: "/data0/pulkitag/data_sets/streetview/exp/window-files/train_pose-euler-mxRot45_geo-dc-v1_crpSz192_nTr-1.00e+06.txt"
		root_folder: "/data0/pulkitag/data_sets/streetview/raw/ssd105/Amir/WashingtonAligned/" 
		crop_size : 101
		batch_size: 5
		context_pad: 0
		random_crop: false
	}
	include {
		phase: TRAIN
	}
}
layer {
	name: "window_data"
	top:  "data"
	top:  "label"
	type: "GenericWindowData"
	generic_window_data_param {
		source: "/data0/pulkitag/data_sets/streetview/exp/window-files/train_pose-euler-mxRot45_geo-dc-v1_crpSz192_nTr-1.00e+06.txt"
		root_folder: "/data0/pulkitag/data_sets/streetview/raw/ssd105/Amir/WashingtonAligned/" 
		crop_size : 101
		batch_size: 5
		context_pad: 0
		random_crop: false
	}
	include {
		phase: TEST
	}
}
layer {
	name: "ipchannel"
	type: "Slice"
	bottom: "data"
	top   : "data_1"
	top   : "data_2"
	slice_param {
		slice_dim: 1
		slice_point: 3
	}
}
layer {
	name: "silence"
	type: "Silence"
	bottom: "data_1"
	bottom: "data_2"
}


