layer {
	name: "window_data"
	top:  "data"
	top:  "label"
	type: "GenericWindowData"
	generic_window_data_param {
		source: "/data0/pulkitag/data_sets/cities/SanFrancisco_dataset/my/window_files/test_los-cls-ind-bn12_pose-euler_mxRot30_randcrp.txt"
		root_folder: "" 
		crop_size : 227
		batch_size: 5
		context_pad: 24
		random_crop: true
	}
	include {
		phase: TRAIN
	}
}
layer {
	name: "window_data"
	top:  "data"
	top:  "label"
	type: "GenericWindowData"
	generic_window_data_param {
		source: "/data0/pulkitag/data_sets/cities/SanFrancisco_dataset/my/window_files/test_los-cls-ind-bn12_pose-euler_mxRot30_randcrp.txt"
		root_folder: "" 
		crop_size : 227
		batch_size: 5
		context_pad: 24
		random_crop: true
	}
	include {
		phase: TEST
	}
}
layer {
	name: "ipchannel"
	type: "Slice"
	bottom: "data"
	top   : "data_1"
	top   : "data_2"
	slice_param {
		slice_dim: 1
		slice_point: 3
	}
}
layer {
	name: "silence"
	type: "Silence"
	bottom: "data_1"
	bottom: "data_2"
}


