name: 'PythonWindowExample'
layer {
	type: 'Python'
	name: 'pair_data'
	top: 'data'
	top: 'label'
	python_param {
		module: 'python_window_data'
		layer: 'PythonWindowDataParallelLayer'
		param_str: "--batch_size 5 --source /data0/pulkitag/data_sets/streetview/exp/window-files/test_ptch-wngtv-posFrac0.5_spDist100_spVer-v1_geodc-v2_geo-dc-v2_crpSz192_nTe-1.00e+04_rawImSz256.txt --root_folder /data0/pulkitag/data_sets/streetview/proc/resize-im/im256"
	}
}
