name: "RandomNet"
input: "data"
input_dim: 1
input_dim: 1
input_dim: 28
input_dim: 28
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "data"
	top: "conv1"
	convolution_param {
		num_output: 20
		kernel_size: 5
		stride: 3
	}	
}
layer {
	name: "rn1"
	type: "RandomNoise"
	bottom: "conv1"
	top: "rn1"
}
layer {
	name: "output"
	type: "InnerProduct"
	bottom: "rn1"
	top: "output"
	inner_product_param {
		num_output: 10
		weight_filler {
			type: "gaussian"
			std: 0.005
		}
	}
}
