######### Images ##########
layer {
  name: "data"
  type: "Data"
  top: "data"
	top: "label"
  data_param {
		source: "/data1/pulkitag/mnist/lmdb-store/train/images_mnist_transform_classify_train_dRot10_dTrn3_mxRot10_nLbl1e+02_numEx1e+06-lmdb"   
    batch_size: 64
		backend: LMDB
  }
	transform_param{
	  scale: 0.00390625
	}
  include { 
		phase: TRAIN 
	}
}
layer {
  name: "data"
  type: "Data"
  top: "data"
	top: "label"
  data_param {
		source: "/data1/pulkitag/mnist/lmdb-store/test/images_mnist_transform_classify_test_dRot10_dTrn3_mxRot10_nLbl1e+04_numEx1e+04-lmdb"   
   batch_size: 100
	 backend: LMDB
  }
	transform_param{
	  scale: 0.00390625
	}
  include { 
		phase: TEST 
	}
}

